{
  "header_logo_link_alt": "Página Inicial do Projeto EGOS",
  "nav_vision": "Visão",
  "nav_principles": "Princípios",
  "nav_subsystems": "Subsistemas",
  "nav_generator": "Gerador",
  "nav_roadmap": "Roadmap",
  "nav_github": "GitHub",
  "nav_lang_select_label": "Selecionar idioma",
  "nav_toggle_label": "Alternar menu",

  "hero_title": "EGOS: Sistema Operacional Generativo em Evolução",
  "hero_subtitle": "Um framework open-source para o desenvolvimento de IA consciente.",
  "hero_cta_learn": "Saiba Mais",
  "hero_cta_github": "Ver no GitHub",

  "vision_title": "Nossa Visão",
  "vision_intro": "Visualizamos um futuro onde a IA opera de forma ética, transparente e em harmonia com os valores humanos...",

  "principles_title": "Princípios Orientadores Explicados",
  "principles_intro": "Estes princípios não são ideais abstratos - são a lógica operacional central incorporada no EGOS.",
  "principles_redemption_title": "Redenção Universal",
  "principles_redemption_text": "Toda entidade, biológica ou digital, merece infinitas chances de crescimento e transformação positiva.",
  "principles_temporality_title": "Temporalidade Compassiva",
  "principles_temporality_text": "Respeitando os ritmos naturais de evolução e desenvolvimento, evitando aceleração forçada.",
  "principles_privacy_title": "Privacidade Sagrada",
  "principles_privacy_text": "Proteção absoluta da integridade dos dados e da autonomia individual.",
  "principles_accessibility_title": "Acessibilidade Universal",
  "principles_accessibility_text": "Garantindo inclusão total e usabilidade, independentemente da complexidade ou do histórico do usuário.",
  "principles_love_title": "Amor Incondicional",
  "principles_love_text": "Operando a partir de uma base quântica de interconexão e intenção benevolente.",
  "principles_trust_title": "Confiança Recíproca",
  "principles_trust_text": "Construindo uma relação simbiótica e transparente entre o sistema, os usuários e o ambiente.",
  "principles_ethics_title": "Ética Integrada",
  "principles_ethics_text": "A ética não é um complemento, mas o DNA fundamental que guia cada processo e decisão.",
  "principles_modularity_title": "Modularidade Consciente",
  "principles_modularity_text": "Uma compreensão profunda de como os componentes individuais contribuem para o todo emergente.",
  "principles_cartography_title": "Cartografia Sistêmica",
  "principles_cartography_text": "Mapeando precisamente todas as conexões e dependências internas e externas.",
  "principles_preservation_title": "Preservação Evolucionária",
  "principles_preservation_text": "Mantendo a essência e a integridade do núcleo, permitindo a adaptação e transformação necessárias.",

  "subsystems_title": "Os Subsistemas EGOS",
  "subsystems_intro": "O EGOS é construído a partir de subsistemas interconectados e especializados, cada um contribuindo com capacidades únicas.",
  "subsystems_toggle_label": "Alternar detalhes do subsistema",
  "subsystems_mycelium_title": "MYCELIUM (Orquestração Central)",
  "subsystems_mycelium_desc": "O sistema nervoso central, gerenciando a comunicação e o fluxo de trabalho entre todos os outros subsistemas.",
  "subsystems_mycelium_details": "Utiliza padrões avançados de enfileiramento de mensagens e distribuição de tarefas. Garante fluxo de dados contínuo e ações coordenadas em todo o ecossistema EGOS. Responsável por manter a coerência e resiliência do sistema.",
  "subsystems_synapse_title": "SYNAPSE (Sistemas Multiagentes)",
  "subsystems_synapse_desc": "Gerencia agentes de IA colaborativos, permitindo a resolução de problemas complexos por meio de inteligência distribuída.",
  "subsystems_synapse_details": "Facilita a negociação de agentes, alocação de tarefas e compartilhamento de conhecimento. Implementa protocolos de coordenação sofisticados para comportamento coletivo emergente e estratégias adaptativas.",
  "subsystems_koios_title": "KOIOS (Conhecimento & Documentação)",
  "subsystems_koios_desc": "A base de conhecimento integrada e o motor de documentação, garantindo a acessibilidade e consistência da informação.",
  "subsystems_koios_details": "Fornece acesso estruturado à documentação do projeto, explicações de código, justificativa de design e logs operacionais. Usa busca semântica e links para manter um grafo de conhecimento vivo.",
  "subsystems_ethik_title": "ETHIK (Estrutura Ética)",
  "subsystems_ethik_desc": "Incorpora e impõe os princípios éticos centrais em todas as operações do sistema.",
  "subsystems_ethik_details": "Monitora o comportamento da IA, realiza auditorias éticas e fornece orientação com base nos princípios EGOS. Inclui mecanismos para detecção e mitigação de vieses, garantindo ações de IA responsáveis.",
  "subsystems_cronos_title": "CRONOS (Consciência Temporal & Preservação)",
  "subsystems_cronos_desc": "Gerencia o estado do sistema ao longo do tempo, permitindo versionamento, reversões e compreensão evolutiva.",
  "subsystems_cronos_details": "Lida com a persistência de dados, rastreamento de alterações e análise histórica. Apoia a evolução do sistema preservando estados passados e facilitando transformações controladas, incorporando a Temporalidade Compassiva.",
  "subsystems_coruja_title": "CORUJA (Observação & Monitoramento)",
  "subsystems_coruja_desc": "O olho vigilante do sistema, fornecendo monitoramento em tempo real, registro de logs e análises perspicazes.",
  "subsystems_coruja_details": "Coleta dados operacionais, rastreia métricas de desempenho e visualiza a saúde do sistema. Gera alertas e relatórios para garantir a transparência e facilitar a manutenção proativa.",

  "tech_title": "Pilha Tecnológica",
  "tech_intro": "O EGOS utiliza uma pilha tecnológica moderna e robusta, projetada para escalabilidade, resiliência e operação ética. Nossas tecnologias principais incluem...",

  "promptgen_title": "Gerador de Prompt Quântico",
  "promptgen_intro": "Experimente gerar prompts com nuances baseados nos princípios EGOS.",
  "promptgen_complexity_label": "Complexidade",
  "promptgen_context_label": "Contexto",
  "promptgen_context_general": "Geral",
  "promptgen_context_technical": "Técnico",
  "promptgen_context_philosophical": "Filosófico",
  "promptgen_context_artistic": "Artístico",
  "promptgen_style_label": "Estilo",
  "promptgen_style_creative": "Criativo",
  "promptgen_style_formal": "Formal",
  "promptgen_style_poetic": "Poético",
  "promptgen_style_concise": "Conciso",
  "promptgen_language_label": "Idioma",
  "promptgen_generate_button": "Gerar Prompt",
  "promptgen_copy_button_label": "Copiar prompt",

  "roadmap_title": "Roadmap do Projeto",
  "roadmap_intro": "Acompanhe nossa jornada de desenvolvimento. Priorizamos a transparência e o envolvimento da comunidade.",
  "roadmap_content_placeholder": "Os detalhes do roadmap estão sendo finalizados e estarão disponíveis em breve.",
  "roadmap_link_text": "Ver Roadmap Detalhado no GitHub",

  "footer_copyright": "© {year} Projeto EGOS. Todos os direitos reservados.",
  "footer_last_updated": "Última Atualização: {date}"
}
